# ExportLayerInfo Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLayerInfo Methods
ExportLayerInfo Class See Also
---
The ExportLayerInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddCutLayerModifier | Adds a cut layer modifier to the layer info. |
| AddLayerModifier | Adds a project layer modifier to the layer info. |
| ClearCutLayerModifiers | Clears all the cut layer modifiers stored in the layer info. |
| ClearLayerModifiers | Clears all the project layer modifiers stored in the layer info. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCutLayerModifiers | Gets all the cut layer modifiers from the layer info. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLayerModifiers | Gets all the project layer modifiers from the layer info. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| RemoveCutLayerModifier | Removes a cut layer modifier from the layer info. |
| RemoveLayerModifier | Removes a project layer modifier from the layer info. |
| SetCutLayerModifiers | Sets a cut layer modifier array to the layer info. |
| SetLayerModifiers | Sets a project layer modifier array to the layer info. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace